# 01. Analysis Seoul CCTV

In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv("../data/01. Seoul_CCTV.csv", encoding="utf-8")

In [3]:
# 데이터의 가장 상단 5개 데이터 읽기
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [4]:
# 데이터의 가장 하단 5개 데이터 읽기
CCTV_Seoul.tail()

    기관명    소계  2013년도 이전  2014년  2015년  2016년
20  용산구  2096       1368    218    112    398
21  은평구  2108       1138    224    278    468
22  종로구  1619        464    314    211    630
23   중구  1023        413    190     72    348
24  중랑구   916        509    121    177    109

In [5]:
# 컬럼명 확인
CCTV_Seoul.columns[0]

'기관명'

In [6]:
# 컬럼명 변경
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: "구별"}, inplace=True) # inplace=True -> 변경된 내용 바로 저장

In [7]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [8]:
# 인구 데이터 가져오기
pop_Seoul = pd.read_excel("../data/01. Seoul_Population.xls")

In [9]:
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017,합계,4220082,10124579,4957857,5166722,9857426,4830206,5027220,267153,127651,139502,2.34,1365126
3,2017,종로구,73594,164257,80094,84163,154770,75967,78803,9487,4127,5360,2.1,26182
4,2017,중구,60412,134593,66337,68256,125709,62253,63456,8884,4084,4800,2.08,21384

In [10]:
# 원하는 데이터만 가져오기
pop_Seoul = pd.read_excel(
    "../data/01. Seoul_Population.xls", header=2, usecols="B, D, G, J, N"
)

In [11]:
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [12]:
# 컬럼명 변경
pop_Seoul.rename(
    columns={
        pop_Seoul.columns[0]: "구별",
        pop_Seoul.columns[1]: "인구수",
        pop_Seoul.columns[2]: "한국인",
        pop_Seoul.columns[3]: "외국인",
        pop_Seoul.columns[4]: "고령자"
    },
    inplace=True
)

pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

## Pandas 기초
- Python에서 R만큼의 강력한 데이터 핸들링 성능을 제공하는 모듈
- 단일 프로세스에서는 최대 효율
- 코딩 가능하고 응용 가능한 엑셀로 인식해도 됨
- 누군가는 스테로이드를 맞은 엑셀로 표현하기도 함

### Series 데이터
- index, value로 이루어져 있다.
- 한 가지 데이터 타입만 가질 수 있다.

In [21]:
import pandas as pd
import numpy as np

-  pandas는 통상 pd / numpy는 통상 np 라고 import 한다.

In [4]:
pd.Series()

Series([], dtype: object)

In [6]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
pd.Series([1, 2, 3, 4], dtype=float64)

NameError: name 'float64' is not defined

In [8]:
pd.Series([1, 2, 3, 4], dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [9]:
pd.Series([1, 2, 3, 4], dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [ ]:
pd.Series([1, 2, 3, 4], dtype=np.float64)

In [10]:
pd.Series(np.array([1, 2, 3]))

0    1
1    2
2    3
dtype: int32

In [11]:
pd.Series({"Key": "Value"})

Key    Value
dtype: object

In [14]:
data = pd.Series([1, 2, 3, 4, "5"])
data

0    1
1    2
2    3
3    4
4    5
dtype: object

In [15]:
# 짝수 찾기
data & 2

TypeError: Cannot perform 'and_' with a dtyped [object] array and scalar of type [bool]

In [16]:
data = pd.Series([1, 2, 3, 4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
# 짝수 찾기
data % 2

0    1
1    0
2    1
3    0
dtype: int64

### 날짜 데이터

In [20]:
pd.date_range("20210101", periods=6)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

### DataFrame
- index, value, column로 이루어져 있다.
- DataFrame은 Series 데이터타입들이 모여 이루어진 것이다

In [24]:
# 표준정규분포에서 랜덤하게 샘플링한 난수 생성
data = np.random.randn(6, 4)
data

array([[ 0.31659615,  0.55700702,  0.42805579, -0.42844389],
       [ 2.58744272,  1.1928059 , -0.38508774, -0.14342242],
       [ 1.24516738,  0.18617449,  1.05867069,  0.53176694],
       [-1.47598463, -0.42754302, -1.97985728,  1.9798311 ],
       [-2.56892668, -2.84343434, -1.56941788, -0.10687329],
       [ 0.52028644,  0.4015004 , -0.80454558,  0.17467407]])

In [26]:
index = pd.date_range("20210101", periods=6)
index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df = pd.DataFrame(data, index, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873
2021-01-06  0.520286  0.401500 -0.804546  0.174674

#### DataFrame 정보 탐색

In [30]:
df.head()

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873

In [31]:
df.tail()

                   A         B         C         D
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873
2021-01-06  0.520286  0.401500 -0.804546  0.174674

In [32]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [33]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [34]:
df.values

array([[ 0.31659615,  0.55700702,  0.42805579, -0.42844389],
       [ 2.58744272,  1.1928059 , -0.38508774, -0.14342242],
       [ 1.24516738,  0.18617449,  1.05867069,  0.53176694],
       [-1.47598463, -0.42754302, -1.97985728,  1.9798311 ],
       [-2.56892668, -2.84343434, -1.56941788, -0.10687329],
       [ 0.52028644,  0.4015004 , -0.80454558,  0.17467407]])

In [37]:
# 데이터 프레임의 기본 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [38]:
# 데이터 프레임의 기술 통계 정보 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.104097 -0.155582 -0.542030  0.334589
std    1.861673  1.417856  1.159287  0.869123
min   -2.568927 -2.843434 -1.979857 -0.428444
25%   -1.027839 -0.274114 -1.378200 -0.134285
50%    0.418441  0.293837 -0.594817  0.033900
75%    1.063947  0.518130  0.224770  0.442494
max    2.587443  1.192806  1.058671  1.979831

#### DataFrame 데이터 정렬

In [60]:
# 특정 컬럼 (열)을 기준으로 데이터 정렬
df.sort_values(by="B", ascending=False, inplace=True) # B 컬럼을 기준으로 내림차순으로 데이터 정렬한 후 변경 상태 저장

In [61]:
df

                   A         B         C         D
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-06  0.520286  0.401500 -0.804546  0.174674
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873

#### DataFrame 데이터 선택

In [48]:
# 한 개의 컬럼 선택 -> 반환 타입 = Series
df['A']

2021-01-02    2.587443
2021-01-01    0.316596
2021-01-06    0.520286
2021-01-03    1.245167
2021-01-04   -1.475985
2021-01-05   -2.568927
Name: A, dtype: float64

In [49]:
type(df['A'])

pandas.core.series.Series

In [50]:
# 컬럼명이 숫자가 아닌 문자열일 경우, 더 간단한 방법으로 열을 선택할 수 있다.
df.A

2021-01-02    2.587443
2021-01-01    0.316596
2021-01-06    0.520286
2021-01-03    1.245167
2021-01-04   -1.475985
2021-01-05   -2.568927
Name: A, dtype: float64

In [52]:
# 두 개 이상 컬럼 선택 -> 반환 타입 = DataFrame
df[['A', 'B']]

                   A         B
2021-01-02  2.587443  1.192806
2021-01-01  0.316596  0.557007
2021-01-06  0.520286  0.401500
2021-01-03  1.245167  0.186174
2021-01-04 -1.475985 -0.427543
2021-01-05 -2.568927 -2.843434

#### DataFrame 데이터 슬라이싱
- offset index : [n:m] : n부터 m-1까지
    - 숫자가 아닌 인덱스나 컬럼의 이름으로 슬라이싱할 경우, 끝 데이터를 포함한다.

In [62]:
df = pd.DataFrame(data, index, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873
2021-01-06  0.520286  0.401500 -0.804546  0.174674

In [63]:
df[0:3]

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767

In [65]:
df["20210101":"20210104"] # 데이터가 정렬된 상황에서만 가능

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831

In [66]:
# loc: location의 약자 / index 이름으로 특정 행, 열 선택
df.loc[:, ["A", "B"]] # 전체 행, A & B 컬럼 선택

                   A         B
2021-01-01  0.316596  0.557007
2021-01-02  2.587443  1.192806
2021-01-03  1.245167  0.186174
2021-01-04 -1.475985 -0.427543
2021-01-05 -2.568927 -2.843434
2021-01-06  0.520286  0.401500

In [67]:
df.loc['20210102':'20210104', ['A', 'D']]

                   A         D
2021-01-02  2.587443 -0.143422
2021-01-03  1.245167  0.531767
2021-01-04 -1.475985  1.979831

In [68]:
df.loc['20210102':'20210104', 'A':'D']

                   A         B         C         D
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831

In [70]:
# iloc : integer location의 약자 / 컴퓨터가 인식하는 인덱스 값으로 선택
df.iloc[3] # 3번째 행 선택

A   -1.475985
B   -0.427543
C   -1.979857
D    1.979831
Name: 2021-01-04 00:00:00, dtype: float64

In [71]:
df.iloc[3, 2]

-1.9798572819782592

In [72]:
df.iloc[3:5, 0:2] # 마지막 인덱스 제외

                   A         B
2021-01-04 -1.475985 -0.427543
2021-01-05 -2.568927 -2.843434

In [73]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2021-01-02  2.587443 -0.385088
2021-01-03  1.245167  1.058671
2021-01-05 -2.568927 -1.569418

#### 조건문으로 DataFrame 데이터 필터링

In [74]:
# A 컬럼에서 0보다 큰 숫자만 필터링
df['A'] > 0

2021-01-01     True
2021-01-02     True
2021-01-03     True
2021-01-04    False
2021-01-05    False
2021-01-06     True
Freq: D, Name: A, dtype: bool

In [76]:
# 전체 데이터에서 A 컬럼의 값이 0보다 큰 셀만 필터링
df[df['A'] > 0]

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-06  0.520286  0.401500 -0.804546  0.174674

In [77]:
# 전체 데이터에서 0보다 큰 셀만 필터링 -> 해당되지 않는 값은 NaN (Not a Number)으로 표시
df[df > 0]

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056       NaN
2021-01-02  2.587443  1.192806       NaN       NaN
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04       NaN       NaN       NaN  1.979831
2021-01-05       NaN       NaN       NaN       NaN
2021-01-06  0.520286  0.401500       NaN  0.174674

In [83]:
# isin : 특정 요소가 있는지 확인
df['E'].isin(['two', 'five'])

2021-01-01    False
2021-01-02    False
2021-01-03     True
2021-01-04    False
2021-01-05    False
2021-01-06    False
Freq: D, Name: E, dtype: bool

In [84]:
df[df['E'].isin(['two', 'five'])]

                   A         B         C         D    E
2021-01-03  1.245167  0.186174  1.058671  0.531767  two

#### DataFrame 컬럼 추가
- 기존 컬럼이 없으면 추가
- 기존 컬럼이 있으면 수정

In [79]:
df['E'] = ['zero', 'one', 'two', 'three', 'four', 'five']
df

                   A         B         C         D      E
2021-01-01  0.316596  0.557007  0.428056 -0.428444   zero
2021-01-02  2.587443  1.192806 -0.385088 -0.143422    one
2021-01-03  1.245167  0.186174  1.058671  0.531767    two
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831  three
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873   four
2021-01-06  0.520286  0.401500 -0.804546  0.174674   five

In [80]:
df['E'] = ['zero', 'one', 'two', 'three', 'four', 'six']
df

                   A         B         C         D      E
2021-01-01  0.316596  0.557007  0.428056 -0.428444   zero
2021-01-02  2.587443  1.192806 -0.385088 -0.143422    one
2021-01-03  1.245167  0.186174  1.058671  0.531767    two
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831  three
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873   four
2021-01-06  0.520286  0.401500 -0.804546  0.174674    six

#### 특정 컬럼 제거
1. del
2. drop

In [85]:
del df['E']
df

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-04 -1.475985 -0.427543 -1.979857  1.979831
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873
2021-01-06  0.520286  0.401500 -0.804546  0.174674

In [88]:
df.drop(['D'], axis=1) # axis = 0 가로 (행, 인덱스) / axis = 1 세로 (열, 컬럼)

                   A         B         C
2021-01-01  0.316596  0.557007  0.428056
2021-01-02  2.587443  1.192806 -0.385088
2021-01-03  1.245167  0.186174  1.058671
2021-01-04 -1.475985 -0.427543 -1.979857
2021-01-05 -2.568927 -2.843434 -1.569418
2021-01-06  0.520286  0.401500 -0.804546

In [89]:
df.drop(['20210104']) # axis = 0 가로 : 디폴트

                   A         B         C         D
2021-01-01  0.316596  0.557007  0.428056 -0.428444
2021-01-02  2.587443  1.192806 -0.385088 -0.143422
2021-01-03  1.245167  0.186174  1.058671  0.531767
2021-01-05 -2.568927 -2.843434 -1.569418 -0.106873
2021-01-06  0.520286  0.401500 -0.804546  0.174674

#### DataFrame에 일괄적으로 함수 적용

In [90]:
# A 컬럼 전체 합
df['A'].apply('sum')

0.6245813876897223

In [91]:
# A 컬럼 전체 평균
df['A'].apply('mean')

0.10409689794828704

In [92]:
# A 컬럼 전체 최소, 최대
df['A'].apply('min'), df['A'].apply('max')

(-2.568926677607955, 2.587442721292634)

In [95]:
df[['A', 'C']].apply('sum')

A    0.624581
C   -3.252182
dtype: float64

In [97]:
# numpy의 기능을 적용할 수도 있음
df['A'].apply(np.sum)

2021-01-01    0.316596
2021-01-02    2.587443
2021-01-03    1.245167
2021-01-04   -1.475985
2021-01-05   -2.568927
2021-01-06    0.520286
Freq: D, Name: A, dtype: float64

In [99]:
df['A'].apply(np.std)

2021-01-01    0.0
2021-01-02    0.0
2021-01-03    0.0
2021-01-04    0.0
2021-01-05    0.0
2021-01-06    0.0
Freq: D, Name: A, dtype: float64

In [100]:
df.apply(np.sum)

A    0.624581
B   -0.933490
C   -3.252182
D    2.007533
dtype: float64

In [103]:
# 사용자 정의 함수도 사용 가능
def plusminus(num):
    return 'plus' if num > 0 else 'minus'
df['A'].apply(plusminus)

2021-01-01     plus
2021-01-02     plus
2021-01-03     plus
2021-01-04    minus
2021-01-05    minus
2021-01-06     plus
Freq: D, Name: A, dtype: object

In [106]:
# 람다 함수도 적용 가능
df['A'].apply(lambda num: 'plus' if num > 0 else 'minus')

2021-01-01     plus
2021-01-02     plus
2021-01-03     plus
2021-01-04    minus
2021-01-05    minus
2021-01-06     plus
Freq: D, Name: A, dtype: object